In [3]:
import pandas as pd

In [4]:
pd.__version__

'2.0.0'

In [5]:
df = pd.DataFrame(
    {
    "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [6]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [7]:
df["Name"]

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [8]:
data = {
 "calories": [420, 380, 390],
 "duration": [50, 40, 45]
}

In [9]:
df_1 = pd.DataFrame(data)
df_1

   calories  duration
0       420        50
1       380        40
2       390        45

In [10]:
df_1.loc[0]

calories    420
duration     50
Name: 0, dtype: int64

In [11]:
# Series

In [12]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [13]:
# Pandas Series

In [14]:
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [15]:
ages = pd.Series([22, 35, 58], name="Age")
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [16]:
df["Age"].max()

58

In [17]:
df["Age"].min()

22

In [18]:
df["Age"].describe()

count     3.000000
mean     38.333333
std      18.230012
min      22.000000
25%      28.500000
50%      35.000000
75%      46.500000
max      58.000000
Name: Age, dtype: float64

In [19]:
# Labels

In [20]:
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])

In [21]:
print(myvar)

x    1
y    7
z    2
dtype: int64

In [22]:
print(myvar["y"])

7

In [23]:
# Read CSV Files

In [24]:
df = pd.read_csv('C:/Users/mmuzz/OneDrive - Punjab Group of Colleges/S23/BD/data.csv')

In [25]:
print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [26]:
print(pd.options.display.max_rows)

60

In [27]:
pd.options.display.max_rows = 2

In [28]:
print(pd.options.display.max_rows)

2

In [29]:
# Read Excel File